Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum
Defines the analysis decomposed load directions.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum.X
The analysis decomposed load direction is in the direction of the X-axis.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum.Y
The analysis decomposed load direction is in the direction of the Y-axis.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum.Z
The analysis decomposed load direction is in the direction of the Z-axis.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum.RX
The analysis decomposed load direction is in the rotation of the X-axis.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum.RY
The analysis decomposed load direction is in the rotation of the Y-axis.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum.RZ
The analysis decomposed load direction is in the rotation of the Z-axis.